;;; -*- mode: emacs-lisp ; coding: utf-8-unix -*-
;;; last updated : 2013/09/21.22:19:28


;;==============================================================================
;; flymake setup
;;==============================================================================


(require 'flymake)





;;------------------------------------------------------------------------------
;; basic setting                                                       
;;------------------------------------------------------------------------------


;; GUIの警告は表示しない
(setq flymake-gui-warnings-enabled nil)

;; 文法チェックの頻度の設定
(setq flymake-no-changes-timeout 0.5)

;; 改行時に文法チェックを行うかどうかの設定
(setq flymake-start-syntax-check-on-newline nil)

;; ログの出力を制御
;; Logging level, only messages with level lower or equal will be logged.
;; -1 = NONE, 0 = ERROR, 1 = WARNING, 2 = INFO, 3 = DEBUG
(setq flymake-log-level 0)



;;------------------------------------------------------------------------------
;; add hook                                                                     
;;------------------------------------------------------------------------------






(provide 'flymake.config)
;;------------------------------------------------------------------------------
;; EOF
